RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/*******************  Bit definition for BKP_DR9 register  ********************/
#define  BKP_DR9_D                           ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR10 register  *******************/
#define  BKP_DR10_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR11 register  *******************/
#define  BKP_DR11_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR12 register  *******************/
#define  BKP_DR12_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR13 register  *******************/
#define  BKP_DR13_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR14 register  *******************/
#define  BKP_DR14_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR15 register  *******************/
#define  BKP_DR15_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR16 register  *******************/
#define  BKP_DR16_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR17 register  *******************/
#define  BKP_DR17_D                          ((u16)0xFFFF)     /* Backup data */


/******************  Bit definition for BKP_DR18 register  ********************/
#define  BKP_DR18_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR19 register  *******************/
#define  BKP_DR19_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR20 register  *******************/
#define  BKP_DR20_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR21 register  *******************/
#define  BKP_DR21_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR22 register  *******************/
#define  BKP_DR22_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR23 register  *******************/
#define  BKP_DR23_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR24 register  *******************/
#define  BKP_DR24_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR25 register  *******************/
#define  BKP_DR25_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR26 register  *******************/
#define  BKP_DR26_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR27 register  *******************/
#define  BKP_DR27_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR28 register  *******************/
#define  BKP_DR28_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR29 register  *******************/
#define  BKP_DR29_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR30 register  *******************/
#define  BKP_DR30_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR31 register  *******************/
#define  BKP_DR31_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR32 register  *******************/
#define  BKP_DR32_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR33 register  *******************/
#define  BKP_DR33_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR34 register  *******************/
#define  BKP_DR34_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR35 register  *******************/
#define  BKP_DR35_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR36 register  *******************/
#define  BKP_DR36_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR37 register  *******************/
#define  BKP_DR37_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR38 register  *******************/
#define  BKP_DR38_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR39 register  *******************/
#define  BKP_DR39_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR40 register  *******************/
#define  BKP_DR40_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR41 register  *******************/
#define  BKP_DR41_D                          ((u16)0xFFFF)     /* Backup data */


/*******************  Bit definition for BKP_DR42 register  *******************/
#define  BKP_DR42_D                          ((u16)0xFFFF)     /* Backup data */


/******************  Bit definition for BKP_RTCCR register  *******************/
#define  BKP_RTCCR_CAL                       ((u16)0x007F)     /* Calibration value */
#define  BKP_RTCCR_CCO                       ((u16)0x0080)     /* Calibration Clock Output */
#define  BKP_RTCCR_ASOE                      ((u16)0x0100)     /* Alarm or Second Output Enable */
#define  BKP_RTCCR_ASOS                      ((u16)0x0200)     /* Alarm or Second Output Selection */


/********************  Bit definition for BKP_CR register  ********************/
#define  BKP_CR_TPE                          ((u8)0x01)        /* TAMPER pin enable */
#define  BKP_CR_TPAL                         ((u8)0x02)        /* TAMPER pin active level */


/*******************  Bit definition for BKP_CSR register  ********************/
#define  BKP_CSR_CTE                         ((u16)0x0001)     /* Clear Tamper event */
#define  BKP_CSR_CTI                         ((u16)0x0002)     /* Clear Tamper Interrupt */
#define  BKP_CSR_TPIE                        ((u16)0x0004)     /* TAMPER Pin interrupt enable */
#define  BKP_CSR_TEF                         ((u16)0x0100)     /* Tamper Event Flag */
#define  BKP_CSR_TIF                         ((u16)0x0200)     /* Tamper Interrupt Flag */



/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/


/********************  Bit definition for RCC_CR register  ********************/
#define  RCC_CR_HSION                        ((u32)0x00000001)        /* Internal High Speed clock enable */
#define  RCC_CR_HSIRDY                       ((u32)0x00000002)        /* Internal High Speed clock ready flag */
#define  RCC_CR_HSITRIM                      ((u32)0x000000F8)        /* Internal High Speed clock trimming */
#define  RCC_CR_HSICAL                       ((u32)0x0000FF00)        /* Internal High Speed clock Calibration */
#define  RCC_CR_HSEON                        ((u32)0x00010000)        /* External High Speed clock enable */
#define  RCC_CR_HSERDY                       ((u32)0x00020000)        /* External High Speed clock ready flag */
#define  RCC_CR_HSEBYP                       ((u32)0x00040000)        /* External High Speed clock Bypass */
#define  RCC_CR_CSSON                        ((u32)0x00080000)        /* Clock Security System enable */
#define  RCC_CR_PLLON                        ((u32)0x01000000)        /* PLL enable */
#define  RCC_CR_PLLRDY                       ((u32)0x02000000)        /* PLL clock ready flag */


/*******************  Bit definition for RCC_CFGR register  *******************/
#define  RCC_CFGR_SW                         ((u32)0x00000003)        /* SW[1:0] bits (System clock Switch) */
#define  RCC_CFGR_SW_0                       ((u32)0x00000001)        /* Bit 0 */
#define  RCC_CFGR_SW_1                       ((u32)0x00000002)        /* Bit 1 */

