RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
#define  DMA_CCR2_PL                         ((u16)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CCR2_PL_0                       ((u16)0x1000)            /* Bit 0 */
#define  DMA_CCR2_PL_1                       ((u16)0x2000)            /* Bit 1 */

#define  DMA_CCR2_MEM2MEM                    ((u16)0x4000)            /* Memory to memory mode */


/*******************  Bit definition for DMA_CCR3 register  *******************/
#define  DMA_CCR3_EN                         ((u16)0x0001)            /* Channel enable */
#define  DMA_CCR3_TCIE                       ((u16)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CCR3_HTIE                       ((u16)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CCR3_TEIE                       ((u16)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CCR3_DIR                        ((u16)0x0010)            /* Data transfer direction */
#define  DMA_CCR3_CIRC                       ((u16)0x0020)            /* Circular mode */
#define  DMA_CCR3_PINC                       ((u16)0x0040)            /* Peripheral increment mode */
#define  DMA_CCR3_MINC                       ((u16)0x0080)            /* Memory increment mode */

#define  DMA_CCR3_PSIZE                      ((u16)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CCR3_PSIZE_0                    ((u16)0x0100)            /* Bit 0 */
#define  DMA_CCR3_PSIZE_1                    ((u16)0x0200)            /* Bit 1 */

#define  DMA_CCR3_MSIZE                      ((u16)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CCR3_MSIZE_0                    ((u16)0x0400)            /* Bit 0 */
#define  DMA_CCR3_MSIZE_1                    ((u16)0x0800)            /* Bit 1 */

#define  DMA_CCR3_PL                         ((u16)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CCR3_PL_0                       ((u16)0x1000)            /* Bit 0 */
#define  DMA_CCR3_PL_1                       ((u16)0x2000)            /* Bit 1 */

#define  DMA_CCR3_MEM2MEM                    ((u16)0x4000)            /* Memory to memory mode */


/*******************  Bit definition for DMA_CCR4 register  *******************/
#define  DMA_CCR4_EN                         ((u16)0x0001)            /* Channel enable */
#define  DMA_CCR4_TCIE                       ((u16)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CCR4_HTIE                       ((u16)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CCR4_TEIE                       ((u16)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CCR4_DIR                        ((u16)0x0010)            /* Data transfer direction */
#define  DMA_CCR4_CIRC                       ((u16)0x0020)            /* Circular mode */
#define  DMA_CCR4_PINC                       ((u16)0x0040)            /* Peripheral increment mode */
#define  DMA_CCR4_MINC                       ((u16)0x0080)            /* Memory increment mode */

#define  DMA_CCR4_PSIZE                      ((u16)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CCR4_PSIZE_0                    ((u16)0x0100)            /* Bit 0 */
#define  DMA_CCR4_PSIZE_1                    ((u16)0x0200)            /* Bit 1 */

#define  DMA_CCR4_MSIZE                      ((u16)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CCR4_MSIZE_0                    ((u16)0x0400)            /* Bit 0 */
#define  DMA_CCR4_MSIZE_1                    ((u16)0x0800)            /* Bit 1 */

#define  DMA_CCR4_PL                         ((u16)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CCR4_PL_0                       ((u16)0x1000)            /* Bit 0 */
#define  DMA_CCR4_PL_1                       ((u16)0x2000)            /* Bit 1 */

#define  DMA_CCR4_MEM2MEM                    ((u16)0x4000)            /* Memory to memory mode */


/******************  Bit definition for DMA_CCR5 register  *******************/
#define  DMA_CCR5_EN                         ((u16)0x0001)            /* Channel enable */
#define  DMA_CCR5_TCIE                       ((u16)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CCR5_HTIE                       ((u16)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CCR5_TEIE                       ((u16)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CCR5_DIR                        ((u16)0x0010)            /* Data transfer direction */
#define  DMA_CCR5_CIRC                       ((u16)0x0020)            /* Circular mode */
#define  DMA_CCR5_PINC                       ((u16)0x0040)            /* Peripheral increment mode */
#define  DMA_CCR5_MINC                       ((u16)0x0080)            /* Memory increment mode */

#define  DMA_CCR5_PSIZE                      ((u16)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CCR5_PSIZE_0                    ((u16)0x0100)            /* Bit 0 */
#define  DMA_CCR5_PSIZE_1                    ((u16)0x0200)            /* Bit 1 */

#define  DMA_CCR5_MSIZE                      ((u16)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CCR5_MSIZE_0                    ((u16)0x0400)            /* Bit 0 */
#define  DMA_CCR5_MSIZE_1                    ((u16)0x0800)            /* Bit 1 */

#define  DMA_CCR5_PL                         ((u16)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CCR5_PL_0                       ((u16)0x1000)            /* Bit 0 */
#define  DMA_CCR5_PL_1                       ((u16)0x2000)            /* Bit 1 */

#define  DMA_CCR5_MEM2MEM                    ((u16)0x4000)            /* Memory to memory mode enable */


/*******************  Bit definition for DMA_CCR6 register  *******************/
#define  DMA_CCR6_EN                         ((u16)0x0001)            /* Channel enable */
#define  DMA_CCR6_TCIE                       ((u16)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CCR6_HTIE                       ((u16)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CCR6_TEIE                       ((u16)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CCR6_DIR                        ((u16)0x0010)            /* Data transfer direction */
#define  DMA_CCR6_CIRC                       ((u16)0x0020)            /* Circular mode */
#define  DMA_CCR6_PINC                       ((u16)0x0040)            /* Peripheral increment mode */
#define  DMA_CCR6_MINC                       ((u16)0x0080)            /* Memory increment mode */

#define  DMA_CCR6_PSIZE                      ((u16)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CCR6_PSIZE_0                    ((u16)0x0100)            /* Bit 0 */
#define  DMA_CCR6_PSIZE_1                    ((u16)0x0200)            /* Bit 1 */

