RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/******************  Bit definition for TIM_CCMR1 register  *******************/
#define  TIM_CCMR1_CC1S                      ((u16)0x0003)            /* CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define  TIM_CCMR1_CC1S_0                    ((u16)0x0001)            /* Bit 0 */
#define  TIM_CCMR1_CC1S_1                    ((u16)0x0002)            /* Bit 1 */

#define  TIM_CCMR1_OC1FE                     ((u16)0x0004)            /* Output Compare 1 Fast enable */
#define  TIM_CCMR1_OC1PE                     ((u16)0x0008)            /* Output Compare 1 Preload enable */

#define  TIM_CCMR1_OC1M                      ((u16)0x0070)            /* OC1M[2:0] bits (Output Compare 1 Mode) */
#define  TIM_CCMR1_OC1M_0                    ((u16)0x0010)            /* Bit 0 */
#define  TIM_CCMR1_OC1M_1                    ((u16)0x0020)            /* Bit 1 */
#define  TIM_CCMR1_OC1M_2                    ((u16)0x0040)            /* Bit 2 */

#define  TIM_CCMR1_OC1CE                     ((u16)0x0080)            /* Output Compare 1Clear Enable */

#define  TIM_CCMR1_CC2S                      ((u16)0x0300)            /* CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define  TIM_CCMR1_CC2S_0                    ((u16)0x0100)            /* Bit 0 */
#define  TIM_CCMR1_CC2S_1                    ((u16)0x0200)            /* Bit 1 */

#define  TIM_CCMR1_OC2FE                     ((u16)0x0400)            /* Output Compare 2 Fast enable */
#define  TIM_CCMR1_OC2PE                     ((u16)0x0800)            /* Output Compare 2 Preload enable */

#define  TIM_CCMR1_OC2M                      ((u16)0x7000)            /* OC2M[2:0] bits (Output Compare 2 Mode) */
#define  TIM_CCMR1_OC2M_0                    ((u16)0x1000)            /* Bit 0 */
#define  TIM_CCMR1_OC2M_1                    ((u16)0x2000)            /* Bit 1 */
#define  TIM_CCMR1_OC2M_2                    ((u16)0x4000)            /* Bit 2 */

#define  TIM_CCMR1_OC2CE                     ((u16)0x8000)            /* Output Compare 2 Clear Enable */

/*----------------------------------------------------------------------------*/

#define  TIM_CCMR1_IC1PSC                    ((u16)0x000C)            /* IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define  TIM_CCMR1_IC1PSC_0                  ((u16)0x0004)            /* Bit 0 */
#define  TIM_CCMR1_IC1PSC_1                  ((u16)0x0008)            /* Bit 1 */

#define  TIM_CCMR1_IC1F                      ((u16)0x00F0)            /* IC1F[3:0] bits (Input Capture 1 Filter) */
#define  TIM_CCMR1_IC1F_0                    ((u16)0x0010)            /* Bit 0 */
#define  TIM_CCMR1_IC1F_1                    ((u16)0x0020)            /* Bit 1 */
#define  TIM_CCMR1_IC1F_2                    ((u16)0x0040)            /* Bit 2 */
#define  TIM_CCMR1_IC1F_3                    ((u16)0x0080)            /* Bit 3 */

#define  TIM_CCMR1_IC2PSC                    ((u16)0x0C00)            /* IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define  TIM_CCMR1_IC2PSC_0                  ((u16)0x0400)            /* Bit 0 */
#define  TIM_CCMR1_IC2PSC_1                  ((u16)0x0800)            /* Bit 1 */

#define  TIM_CCMR1_IC2F                      ((u16)0xF000)            /* IC2F[3:0] bits (Input Capture 2 Filter) */
#define  TIM_CCMR1_IC2F_0                    ((u16)0x1000)            /* Bit 0 */
#define  TIM_CCMR1_IC2F_1                    ((u16)0x2000)            /* Bit 1 */
#define  TIM_CCMR1_IC2F_2                    ((u16)0x4000)            /* Bit 2 */
#define  TIM_CCMR1_IC2F_3                    ((u16)0x8000)            /* Bit 3 */


/******************  Bit definition for TIM_CCMR2 register  *******************/
#define  TIM_CCMR2_CC3S                      ((u16)0x0003)            /* CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define  TIM_CCMR2_CC3S_0                    ((u16)0x0001)            /* Bit 0 */
#define  TIM_CCMR2_CC3S_1                    ((u16)0x0002)            /* Bit 1 */

#define  TIM_CCMR2_OC3FE                     ((u16)0x0004)            /* Output Compare 3 Fast enable */
#define  TIM_CCMR2_OC3PE                     ((u16)0x0008)            /* Output Compare 3 Preload enable */

#define  TIM_CCMR2_OC3M                      ((u16)0x0070)            /* OC3M[2:0] bits (Output Compare 3 Mode) */
#define  TIM_CCMR2_OC3M_0                    ((u16)0x0010)            /* Bit 0 */
#define  TIM_CCMR2_OC3M_1                    ((u16)0x0020)            /* Bit 1 */
#define  TIM_CCMR2_OC3M_2                    ((u16)0x0040)            /* Bit 2 */

#define  TIM_CCMR2_OC3CE                     ((u16)0x0080)            /* Output Compare 3 Clear Enable */

#define  TIM_CCMR2_CC4S                      ((u16)0x0300)            /* CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define  TIM_CCMR2_CC4S_0                    ((u16)0x0100)            /* Bit 0 */
#define  TIM_CCMR2_CC4S_1                    ((u16)0x0200)            /* Bit 1 */

#define  TIM_CCMR2_OC4FE                     ((u16)0x0400)            /* Output Compare 4 Fast enable */
#define  TIM_CCMR2_OC4PE                     ((u16)0x0800)            /* Output Compare 4 Preload enable */

#define  TIM_CCMR2_OC4M                      ((u16)0x7000)            /* OC4M[2:0] bits (Output Compare 4 Mode) */
#define  TIM_CCMR2_OC4M_0                    ((u16)0x1000)            /* Bit 0 */
#define  TIM_CCMR2_OC4M_1                    ((u16)0x2000)            /* Bit 1 */
#define  TIM_CCMR2_OC4M_2                    ((u16)0x4000)            /* Bit 2 */

#define  TIM_CCMR2_OC4CE                     ((u16)0x8000)            /* Output Compare 4 Clear Enable */

/*----------------------------------------------------------------------------*/

#define  TIM_CCMR2_IC3PSC                    ((u16)0x000C)            /* IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define  TIM_CCMR2_IC3PSC_0                  ((u16)0x0004)            /* Bit 0 */
#define  TIM_CCMR2_IC3PSC_1                  ((u16)0x0008)            /* Bit 1 */

#define  TIM_CCMR2_IC3F                      ((u16)0x00F0)            /* IC3F[3:0] bits (Input Capture 3 Filter) */
#define  TIM_CCMR2_IC3F_0                    ((u16)0x0010)            /* Bit 0 */
#define  TIM_CCMR2_IC3F_1                    ((u16)0x0020)            /* Bit 1 */
#define  TIM_CCMR2_IC3F_2                    ((u16)0x0040)            /* Bit 2 */
#define  TIM_CCMR2_IC3F_3                    ((u16)0x0080)            /* Bit 3 */

