RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
#define  TIM_CCMR2_IC4PSC                    ((u16)0x0C00)            /* IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define  TIM_CCMR2_IC4PSC_0                  ((u16)0x0400)            /* Bit 0 */
#define  TIM_CCMR2_IC4PSC_1                  ((u16)0x0800)            /* Bit 1 */

#define  TIM_CCMR2_IC4F                      ((u16)0xF000)            /* IC4F[3:0] bits (Input Capture 4 Filter) */
#define  TIM_CCMR2_IC4F_0                    ((u16)0x1000)            /* Bit 0 */
#define  TIM_CCMR2_IC4F_1                    ((u16)0x2000)            /* Bit 1 */
#define  TIM_CCMR2_IC4F_2                    ((u16)0x4000)            /* Bit 2 */
#define  TIM_CCMR2_IC4F_3                    ((u16)0x8000)            /* Bit 3 */


/*******************  Bit definition for TIM_CCER register  *******************/
#define  TIM_CCER_CC1E                       ((u16)0x0001)            /* Capture/Compare 1 output enable */
#define  TIM_CCER_CC1P                       ((u16)0x0002)            /* Capture/Compare 1 output Polarity */
#define  TIM_CCER_CC1NE                      ((u16)0x0004)            /* Capture/Compare 1 Complementary output enable */
#define  TIM_CCER_CC1NP                      ((u16)0x0008)            /* Capture/Compare 1 Complementary output Polarity */
#define  TIM_CCER_CC2E                       ((u16)0x0010)            /* Capture/Compare 2 output enable */
#define  TIM_CCER_CC2P                       ((u16)0x0020)            /* Capture/Compare 2 output Polarity */
#define  TIM_CCER_CC2NE                      ((u16)0x0040)            /* Capture/Compare 2 Complementary output enable */
#define  TIM_CCER_CC2NP                      ((u16)0x0080)            /* Capture/Compare 2 Complementary output Polarity */
#define  TIM_CCER_CC3E                       ((u16)0x0100)            /* Capture/Compare 3 output enable */
#define  TIM_CCER_CC3P                       ((u16)0x0200)            /* Capture/Compare 3 output Polarity */
#define  TIM_CCER_CC3NE                      ((u16)0x0400)            /* Capture/Compare 3 Complementary output enable */
#define  TIM_CCER_CC3NP                      ((u16)0x0800)            /* Capture/Compare 3 Complementary output Polarity */
#define  TIM_CCER_CC4E                       ((u16)0x1000)            /* Capture/Compare 4 output enable */
#define  TIM_CCER_CC4P                       ((u16)0x2000)            /* Capture/Compare 4 output Polarity */


/*******************  Bit definition for TIM_CNT register  ********************/
#define  TIM_CNT_CNT                         ((u16)0xFFFF)            /* Counter Value */


/*******************  Bit definition for TIM_PSC register  ********************/
#define  TIM_PSC_PSC                         ((u16)0xFFFF)            /* Prescaler Value */


/*******************  Bit definition for TIM_ARR register  ********************/
#define  TIM_ARR_ARR                         ((u16)0xFFFF)            /* actual auto-reload Value */


/*******************  Bit definition for TIM_RCR register  ********************/
#define  TIM_RCR_REP                         ((u8)0xFF)               /* Repetition Counter Value */


/*******************  Bit definition for TIM_CCR1 register  *******************/
#define  TIM_CCR1_CCR1                       ((u16)0xFFFF)            /* Capture/Compare 1 Value */


/*******************  Bit definition for TIM_CCR2 register  *******************/
#define  TIM_CCR2_CCR2                       ((u16)0xFFFF)            /* Capture/Compare 2 Value */


/*******************  Bit definition for TIM_CCR3 register  *******************/
#define  TIM_CCR3_CCR3                       ((u16)0xFFFF)            /* Capture/Compare 3 Value */


/*******************  Bit definition for TIM_CCR4 register  *******************/
#define  TIM_CCR4_CCR4                       ((u16)0xFFFF)            /* Capture/Compare 4 Value */


/*******************  Bit definition for TIM_BDTR register  *******************/
#define  TIM_BDTR_DTG                        ((u16)0x00FF)            /* DTG[0:7] bits (Dead-Time Generator set-up) */
#define  TIM_BDTR_DTG_0                      ((u16)0x0001)            /* Bit 0 */
#define  TIM_BDTR_DTG_1                      ((u16)0x0002)            /* Bit 1 */
#define  TIM_BDTR_DTG_2                      ((u16)0x0004)            /* Bit 2 */
#define  TIM_BDTR_DTG_3                      ((u16)0x0008)            /* Bit 3 */
#define  TIM_BDTR_DTG_4                      ((u16)0x0010)            /* Bit 4 */
#define  TIM_BDTR_DTG_5                      ((u16)0x0020)            /* Bit 5 */
#define  TIM_BDTR_DTG_6                      ((u16)0x0040)            /* Bit 6 */
#define  TIM_BDTR_DTG_7                      ((u16)0x0080)            /* Bit 7 */

#define  TIM_BDTR_LOCK                       ((u16)0x0300)            /* LOCK[1:0] bits (Lock Configuration) */
#define  TIM_BDTR_LOCK_0                     ((u16)0x0100)            /* Bit 0 */
#define  TIM_BDTR_LOCK_1                     ((u16)0x0200)            /* Bit 1 */

#define  TIM_BDTR_OSSI                       ((u16)0x0400)            /* Off-State Selection for Idle mode */
#define  TIM_BDTR_OSSR                       ((u16)0x0800)            /* Off-State Selection for Run mode */
#define  TIM_BDTR_BKE                        ((u16)0x1000)            /* Break enable */
#define  TIM_BDTR_BKP                        ((u16)0x2000)            /* Break Polarity */
#define  TIM_BDTR_AOE                        ((u16)0x4000)            /* Automatic Output enable */
#define  TIM_BDTR_MOE                        ((u16)0x8000)            /* Main Output enable */


/*******************  Bit definition for TIM_DCR register  ********************/
#define  TIM_DCR_DBA                         ((u16)0x001F)            /* DBA[4:0] bits (DMA Base Address) */
#define  TIM_DCR_DBA_0                       ((u16)0x0001)            /* Bit 0 */
#define  TIM_DCR_DBA_1                       ((u16)0x0002)            /* Bit 1 */
#define  TIM_DCR_DBA_2                       ((u16)0x0004)            /* Bit 2 */
#define  TIM_DCR_DBA_3                       ((u16)0x0008)            /* Bit 3 */
#define  TIM_DCR_DBA_4                       ((u16)0x0010)            /* Bit 4 */

#define  TIM_DCR_DBL                         ((u16)0x1F00)            /* DBL[4:0] bits (DMA Burst Length) */
#define  TIM_DCR_DBL_0                       ((u16)0x0100)            /* Bit 0 */
#define  TIM_DCR_DBL_1                       ((u16)0x0200)            /* Bit 1 */
#define  TIM_DCR_DBL_2                       ((u16)0x0400)            /* Bit 2 */
#define  TIM_DCR_DBL_3                       ((u16)0x0800)            /* Bit 3 */
#define  TIM_DCR_DBL_4                       ((u16)0x1000)            /* Bit 4 */


/*******************  Bit definition for TIM_DMAR register  *******************/
#define  TIM_DMAR_DMAB                       ((u16)0xFFFF)            /* DMA register for burst accesses */



/******************************************************************************/
/*                                                                            */
/*                             Real-Time Clock                                */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for RTC_CRH register  ********************/
#define  RTC_CRH_SECIE                       ((u8)0x01)               /* Second Interrupt Enable */
#define  RTC_CRH_ALRIE                       ((u8)0x02)               /* Alarm Interrupt Enable */
#define  RTC_CRH_OWIE                        ((u8)0x04)               /* OverfloW Interrupt Enable */


/*******************  Bit definition for RTC_CRL register  ********************/
#define  RTC_CRL_SECF                        ((u8)0x01)               /* Second Flag */
#define  RTC_CRL_ALRF                        ((u8)0x02)               /* Alarm Flag */
#define  RTC_CRL_OWF                         ((u8)0x04)               /* OverfloW Flag */
#define  RTC_CRL_RSF                         ((u8)0x08)               /* Registers Synchronized Flag */
#define  RTC_CRL_CNF                         ((u8)0x10)               /* Configuration Flag */
#define  RTC_CRL_RTOFF                       ((u8)0x20)               /* RTC operation OFF */


/*******************  Bit definition for RTC_PRLH register  *******************/
#define  RTC_PRLH_PRL                        ((u16)0x000F)            /* RTC Prescaler Reload Value High */


