RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/*******************  Bit definition for RTC_PRLL register  *******************/
#define  RTC_PRLL_PRL                        ((u16)0xFFFF)            /* RTC Prescaler Reload Value Low */


/*******************  Bit definition for RTC_DIVH register  *******************/
#define  RTC_DIVH_RTC_DIV                    ((u16)0x000F)            /* RTC Clock Divider High */


/*******************  Bit definition for RTC_DIVL register  *******************/
#define  RTC_DIVL_RTC_DIV                    ((u16)0xFFFF)            /* RTC Clock Divider Low */


/*******************  Bit definition for RTC_CNTH register  *******************/
#define  RTC_CNTH_RTC_CNT                    ((u16)0xFFFF)            /* RTC Counter High */


/*******************  Bit definition for RTC_CNTL register  *******************/
#define  RTC_CNTL_RTC_CNT                    ((u16)0xFFFF)            /* RTC Counter Low */


/*******************  Bit definition for RTC_ALRH register  *******************/
#define  RTC_ALRH_RTC_ALR                    ((u16)0xFFFF)            /* RTC Alarm High */


/*******************  Bit definition for RTC_ALRL register  *******************/
#define  RTC_ALRL_RTC_ALR                    ((u16)0xFFFF)            /* RTC Alarm Low */



/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for IWDG_KR register  ********************/
#define  IWDG_KR_KEY                         ((u16)0xFFFF)            /* Key value (write only, read 0000h) */


/*******************  Bit definition for IWDG_PR register  ********************/
#define  IWDG_PR_PR                          ((u8)0x07)               /* PR[2:0] (Prescaler divider) */
#define  IWDG_PR_PR_0                        ((u8)0x01)               /* Bit 0 */
#define  IWDG_PR_PR_1                        ((u8)0x02)               /* Bit 1 */
#define  IWDG_PR_PR_2                        ((u8)0x04)               /* Bit 2 */


/*******************  Bit definition for IWDG_RLR register  *******************/
#define  IWDG_RLR_RL                         ((u16)0x0FFF)            /* Watchdog counter reload value */


/*******************  Bit definition for IWDG_SR register  ********************/
#define  IWDG_SR_PVU                         ((u8)0x01)               /* Watchdog prescaler value update */
#define  IWDG_SR_RVU                         ((u8)0x02)               /* Watchdog counter reload value update */



/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for WWDG_CR register  ********************/
#define  WWDG_CR_T                           ((u8)0x7F)               /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CR_T0                          ((u8)0x01)               /* Bit 0 */
#define  WWDG_CR_T1                          ((u8)0x02)               /* Bit 1 */
#define  WWDG_CR_T2                          ((u8)0x04)               /* Bit 2 */
#define  WWDG_CR_T3                          ((u8)0x08)               /* Bit 3 */
#define  WWDG_CR_T4                          ((u8)0x10)               /* Bit 4 */
#define  WWDG_CR_T5                          ((u8)0x20)               /* Bit 5 */
#define  WWDG_CR_T6                          ((u8)0x40)               /* Bit 6 */

#define  WWDG_CR_WDGA                        ((u8)0x80)               /* Activation bit */


/*******************  Bit definition for WWDG_CFR register  *******************/
#define  WWDG_CFR_W                          ((u16)0x007F)            /* W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         ((u16)0x0001)            /* Bit 0 */
#define  WWDG_CFR_W1                         ((u16)0x0002)            /* Bit 1 */
#define  WWDG_CFR_W2                         ((u16)0x0004)            /* Bit 2 */
#define  WWDG_CFR_W3                         ((u16)0x0008)            /* Bit 3 */
#define  WWDG_CFR_W4                         ((u16)0x0010)            /* Bit 4 */
#define  WWDG_CFR_W5                         ((u16)0x0020)            /* Bit 5 */
#define  WWDG_CFR_W6                         ((u16)0x0040)            /* Bit 6 */

#define  WWDG_CFR_WDGTB                      ((u16)0x0180)            /* WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     ((u16)0x0080)            /* Bit 0 */
#define  WWDG_CFR_WDGTB1                     ((u16)0x0100)            /* Bit 1 */

#define  WWDG_CFR_EWI                        ((u16)0x0200)            /* Early Wakeup Interrupt */


/*******************  Bit definition for WWDG_SR register  ********************/
#define  WWDG_SR_EWIF                        ((u8)0x01)               /* Early Wakeup Interrupt Flag */



/******************************************************************************/
/*                                                                            */
/*                       Flexible Static Memory Controller                    */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for FSMC_BCR1 register  *******************/
#define  FSMC_BCR1_MBKEN                     ((u32)0x00000001)        /* Memory bank enable bit */
#define  FSMC_BCR1_MUXEN                     ((u32)0x00000002)        /* Address/data multiplexing enable bit */

#define  FSMC_BCR1_MTYP                      ((u32)0x0000000C)        /* MTYP[1:0] bits (Memory type) */
#define  FSMC_BCR1_MTYP_0                    ((u32)0x00000004)        /* Bit 0 */
#define  FSMC_BCR1_MTYP_1                    ((u32)0x00000008)        /* Bit 1 */

