RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
#define  FSMC_BWTR4_DATAST                   ((u32)0x0000FF00)        /* DATAST [3:0] bits (Data-phase duration) */
#define  FSMC_BWTR4_DATAST_0                 ((u32)0x00000100)        /* Bit 0 */
#define  FSMC_BWTR4_DATAST_1                 ((u32)0x00000200)        /* Bit 1 */
#define  FSMC_BWTR4_DATAST_2                 ((u32)0x00000400)        /* Bit 2 */
#define  FSMC_BWTR4_DATAST_3                 ((u32)0x00000800)        /* Bit 3 */

#define  FSMC_BWTR4_BUSTURN                  ((u32)0x000F0000)        /* BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define  FSMC_BWTR4_BUSTURN_0                ((u32)0x00010000)        /* Bit 0 */
#define  FSMC_BWTR4_BUSTURN_1                ((u32)0x00020000)        /* Bit 1 */
#define  FSMC_BWTR4_BUSTURN_2                ((u32)0x00040000)        /* Bit 2 */
#define  FSMC_BWTR4_BUSTURN_3                ((u32)0x00080000)        /* Bit 3 */

#define  FSMC_BWTR4_CLKDIV                   ((u32)0x00F00000)        /* CLKDIV[3:0] bits (Clock divide ratio) */
#define  FSMC_BWTR4_CLKDIV_0                 ((u32)0x00100000)        /* Bit 0 */
#define  FSMC_BWTR4_CLKDIV_1                 ((u32)0x00200000)        /* Bit 1 */
#define  FSMC_BWTR4_CLKDIV_2                 ((u32)0x00400000)        /* Bit 2 */
#define  FSMC_BWTR4_CLKDIV_3                 ((u32)0x00800000)        /* Bit 3 */

#define  FSMC_BWTR4_DATLAT                   ((u32)0x0F000000)        /* DATLA[3:0] bits (Data latency) */
#define  FSMC_BWTR4_DATLAT_0                 ((u32)0x01000000)        /* Bit 0 */
#define  FSMC_BWTR4_DATLAT_1                 ((u32)0x02000000)        /* Bit 1 */
#define  FSMC_BWTR4_DATLAT_2                 ((u32)0x04000000)        /* Bit 2 */
#define  FSMC_BWTR4_DATLAT_3                 ((u32)0x08000000)        /* Bit 3 */

#define  FSMC_BWTR4_ACCMOD                   ((u32)0x30000000)        /* ACCMOD[1:0] bits (Access mode) */
#define  FSMC_BWTR4_ACCMOD_0                 ((u32)0x10000000)        /* Bit 0 */
#define  FSMC_BWTR4_ACCMOD_1                 ((u32)0x20000000)        /* Bit 1 */


/******************  Bit definition for FSMC_PCR2 register  *******************/
#define  FSMC_PCR2_PWAITEN                   ((u32)0x00000002)        /* Wait feature enable bit */
#define  FSMC_PCR2_PBKEN                     ((u32)0x00000004)        /* PC Card/NAND Flash memory bank enable bit */
#define  FSMC_PCR2_PTYP                      ((u32)0x00000008)        /* Memory type */

#define  FSMC_PCR2_PWID                      ((u32)0x00000030)        /* PWID[1:0] bits (NAND Flash databus width) */
#define  FSMC_PCR2_PWID_0                    ((u32)0x00000010)        /* Bit 0 */
#define  FSMC_PCR2_PWID_1                    ((u32)0x00000020)        /* Bit 1 */

#define  FSMC_PCR2_ECCEN                     ((u32)0x00000040)        /* ECC computation logic enable bit */
#define  FSMC_PCR2_ADLOW                     ((u32)0x00000100)        /* Address low bit delivery */

#define  FSMC_PCR2_TCLR                      ((u32)0x00001E00)        /* TCLR[3:0] bits (CLE to RE delay) */
#define  FSMC_PCR2_TCLR_0                    ((u32)0x00000200)        /* Bit 0 */
#define  FSMC_PCR2_TCLR_1                    ((u32)0x00000400)        /* Bit 1 */
#define  FSMC_PCR2_TCLR_2                    ((u32)0x00000800)        /* Bit 2 */
#define  FSMC_PCR2_TCLR_3                    ((u32)0x00001000)        /* Bit 3 */

#define  FSMC_PCR2_TAR                       ((u32)0x0001E000)        /* TAR[3:0] bits (ALE to RE delay) */
#define  FSMC_PCR2_TAR_0                     ((u32)0x00002000)        /* Bit 0 */
#define  FSMC_PCR2_TAR_1                     ((u32)0x00004000)        /* Bit 1 */
#define  FSMC_PCR2_TAR_2                     ((u32)0x00008000)        /* Bit 2 */
#define  FSMC_PCR2_TAR_3                     ((u32)0x00010000)        /* Bit 3 */

#define  FSMC_PCR2_ECCPS                     ((u32)0x000E0000)        /* ECCPS[1:0] bits (ECC page size) */
#define  FSMC_PCR2_ECCPS_0                   ((u32)0x00020000)        /* Bit 0 */
#define  FSMC_PCR2_ECCPS_1                   ((u32)0x00040000)        /* Bit 1 */
#define  FSMC_PCR2_ECCPS_2                   ((u32)0x00080000)        /* Bit 2 */


/******************  Bit definition for FSMC_PCR3 register  *******************/
#define  FSMC_PCR3_PWAITEN                   ((u32)0x00000002)        /* Wait feature enable bit */
#define  FSMC_PCR3_PBKEN                     ((u32)0x00000004)        /* PC Card/NAND Flash memory bank enable bit */
#define  FSMC_PCR3_PTYP                      ((u32)0x00000008)        /* Memory type */

#define  FSMC_PCR3_PWID                      ((u32)0x00000030)        /* PWID[1:0] bits (NAND Flash databus width) */
#define  FSMC_PCR3_PWID_0                    ((u32)0x00000010)        /* Bit 0 */
#define  FSMC_PCR3_PWID_1                    ((u32)0x00000020)        /* Bit 1 */

#define  FSMC_PCR3_ECCEN                     ((u32)0x00000040)        /* ECC computation logic enable bit */
#define  FSMC_PCR3_ADLOW                     ((u32)0x00000100)        /* Address low bit delivery */

#define  FSMC_PCR3_TCLR                      ((u32)0x00001E00)        /* TCLR[3:0] bits (CLE to RE delay) */
#define  FSMC_PCR3_TCLR_0                    ((u32)0x00000200)        /* Bit 0 */
#define  FSMC_PCR3_TCLR_1                    ((u32)0x00000400)        /* Bit 1 */
#define  FSMC_PCR3_TCLR_2                    ((u32)0x00000800)        /* Bit 2 */
#define  FSMC_PCR3_TCLR_3                    ((u32)0x00001000)        /* Bit 3 */

#define  FSMC_PCR3_TAR                       ((u32)0x0001E000)        /* TAR[3:0] bits (ALE to RE delay) */
#define  FSMC_PCR3_TAR_0                     ((u32)0x00002000)        /* Bit 0 */
#define  FSMC_PCR3_TAR_1                     ((u32)0x00004000)        /* Bit 1 */
#define  FSMC_PCR3_TAR_2                     ((u32)0x00008000)        /* Bit 2 */
#define  FSMC_PCR3_TAR_3                     ((u32)0x00010000)        /* Bit 3 */

#define  FSMC_PCR3_ECCPS                     ((u32)0x000E0000)        /* ECCPS[2:0] bits (ECC page size) */
#define  FSMC_PCR3_ECCPS_0                   ((u32)0x00020000)        /* Bit 0 */
#define  FSMC_PCR3_ECCPS_1                   ((u32)0x00040000)        /* Bit 1 */
#define  FSMC_PCR3_ECCPS_2                   ((u32)0x00080000)        /* Bit 2 */


