RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/*******************  Bit definition for CAN_RDL0R register  ******************/
#define  CAN_RDL0R_DATA0                     ((u32)0x000000FF)        /* Data byte 0 */
#define  CAN_RDL0R_DATA1                     ((u32)0x0000FF00)        /* Data byte 1 */
#define  CAN_RDL0R_DATA2                     ((u32)0x00FF0000)        /* Data byte 2 */
#define  CAN_RDL0R_DATA3                     ((u32)0xFF000000)        /* Data byte 3 */


/*******************  Bit definition for CAN_RDH0R register  ******************/
#define  CAN_RDH0R_DATA4                     ((u32)0x000000FF)        /* Data byte 4 */
#define  CAN_RDH0R_DATA5                     ((u32)0x0000FF00)        /* Data byte 5 */
#define  CAN_RDH0R_DATA6                     ((u32)0x00FF0000)        /* Data byte 6 */
#define  CAN_RDH0R_DATA7                     ((u32)0xFF000000)        /* Data byte 7 */


/*******************  Bit definition for CAN_RI1R register  *******************/
#define  CAN_RI1R_RTR                        ((u32)0x00000002)        /* Remote Transmission Request */
#define  CAN_RI1R_IDE                        ((u32)0x00000004)        /* Identifier Extension */
#define  CAN_RI1R_EXID                       ((u32)0x001FFFF8)        /* Extended identifier */
#define  CAN_RI1R_STID                       ((u32)0xFFE00000)        /* Standard Identifier or Extended Identifier */


/*******************  Bit definition for CAN_RDT1R register  ******************/
#define  CAN_RDT1R_DLC                       ((u32)0x0000000F)        /* Data Length Code */
#define  CAN_RDT1R_FMI                       ((u32)0x0000FF00)        /* Filter Match Index */
#define  CAN_RDT1R_TIME                      ((u32)0xFFFF0000)        /* Message Time Stamp */


/*******************  Bit definition for CAN_RDL1R register  ******************/
#define  CAN_RDL1R_DATA0                     ((u32)0x000000FF)        /* Data byte 0 */
#define  CAN_RDL1R_DATA1                     ((u32)0x0000FF00)        /* Data byte 1 */
#define  CAN_RDL1R_DATA2                     ((u32)0x00FF0000)        /* Data byte 2 */
#define  CAN_RDL1R_DATA3                     ((u32)0xFF000000)        /* Data byte 3 */


/*******************  Bit definition for CAN_RDH1R register  ******************/
#define  CAN_RDH1R_DATA4                     ((u32)0x000000FF)        /* Data byte 4 */
#define  CAN_RDH1R_DATA5                     ((u32)0x0000FF00)        /* Data byte 5 */
#define  CAN_RDH1R_DATA6                     ((u32)0x00FF0000)        /* Data byte 6 */
#define  CAN_RDH1R_DATA7                     ((u32)0xFF000000)        /* Data byte 7 */

/* CAN filter registers */
/*******************  Bit definition for CAN_FMR register  ********************/
#define  CAN_FMR_FINIT                       ((u8)0x01)               /* Filter Init Mode */


/*******************  Bit definition for CAN_FM1R register  *******************/
#define  CAN_FM1R_FBM                        ((u16)0x3FFF)            /* Filter Mode */
#define  CAN_FM1R_FBM0                       ((u16)0x0001)            /* Filter Init Mode bit 0 */
#define  CAN_FM1R_FBM1                       ((u16)0x0002)            /* Filter Init Mode bit 1 */
#define  CAN_FM1R_FBM2                       ((u16)0x0004)            /* Filter Init Mode bit 2 */
#define  CAN_FM1R_FBM3                       ((u16)0x0008)            /* Filter Init Mode bit 3 */
#define  CAN_FM1R_FBM4                       ((u16)0x0010)            /* Filter Init Mode bit 4 */
#define  CAN_FM1R_FBM5                       ((u16)0x0020)            /* Filter Init Mode bit 5 */
#define  CAN_FM1R_FBM6                       ((u16)0x0040)            /* Filter Init Mode bit 6 */
#define  CAN_FM1R_FBM7                       ((u16)0x0080)            /* Filter Init Mode bit 7 */
#define  CAN_FM1R_FBM8                       ((u16)0x0100)            /* Filter Init Mode bit 8 */
#define  CAN_FM1R_FBM9                       ((u16)0x0200)            /* Filter Init Mode bit 9 */
#define  CAN_FM1R_FBM10                      ((u16)0x0400)            /* Filter Init Mode bit 10 */
#define  CAN_FM1R_FBM11                      ((u16)0x0800)            /* Filter Init Mode bit 11 */
#define  CAN_FM1R_FBM12                      ((u16)0x1000)            /* Filter Init Mode bit 12 */
#define  CAN_FM1R_FBM13                      ((u16)0x2000)            /* Filter Init Mode bit 13 */


/*******************  Bit definition for CAN_FS1R register  *******************/
#define  CAN_FS1R_FSC                        ((u16)0x3FFF)            /* Filter Scale Configuration */
#define  CAN_FS1R_FSC0                       ((u16)0x0001)            /* Filter Scale Configuration bit 0 */
#define  CAN_FS1R_FSC1                       ((u16)0x0002)            /* Filter Scale Configuration bit 1 */
#define  CAN_FS1R_FSC2                       ((u16)0x0004)            /* Filter Scale Configuration bit 2 */
#define  CAN_FS1R_FSC3                       ((u16)0x0008)            /* Filter Scale Configuration bit 3 */
#define  CAN_FS1R_FSC4                       ((u16)0x0010)            /* Filter Scale Configuration bit 4 */
#define  CAN_FS1R_FSC5                       ((u16)0x0020)            /* Filter Scale Configuration bit 5 */
#define  CAN_FS1R_FSC6                       ((u16)0x0040)            /* Filter Scale Configuration bit 6 */
#define  CAN_FS1R_FSC7                       ((u16)0x0080)            /* Filter Scale Configuration bit 7 */
#define  CAN_FS1R_FSC8                       ((u16)0x0100)            /* Filter Scale Configuration bit 8 */
#define  CAN_FS1R_FSC9                       ((u16)0x0200)            /* Filter Scale Configuration bit 9 */
#define  CAN_FS1R_FSC10                      ((u16)0x0400)            /* Filter Scale Configuration bit 10 */
#define  CAN_FS1R_FSC11                      ((u16)0x0800)            /* Filter Scale Configuration bit 11 */
#define  CAN_FS1R_FSC12                      ((u16)0x1000)            /* Filter Scale Configuration bit 12 */
#define  CAN_FS1R_FSC13                      ((u16)0x2000)            /* Filter Scale Configuration bit 13 */


/******************  Bit definition for CAN_FFA1R register  *******************/
#define  CAN_FFA1R_FFA                       ((u16)0x3FFF)            /* Filter FIFO Assignment */
#define  CAN_FFA1R_FFA0                      ((u16)0x0001)            /* Filter FIFO Assignment for Filter 0 */
#define  CAN_FFA1R_FFA1                      ((u16)0x0002)            /* Filter FIFO Assignment for Filter 1 */
#define  CAN_FFA1R_FFA2                      ((u16)0x0004)            /* Filter FIFO Assignment for Filter 2 */
#define  CAN_FFA1R_FFA3                      ((u16)0x0008)            /* Filter FIFO Assignment for Filter 3 */
#define  CAN_FFA1R_FFA4                      ((u16)0x0010)            /* Filter FIFO Assignment for Filter 4 */
#define  CAN_FFA1R_FFA5                      ((u16)0x0020)            /* Filter FIFO Assignment for Filter 5 */
#define  CAN_FFA1R_FFA6                      ((u16)0x0040)            /* Filter FIFO Assignment for Filter 6 */
#define  CAN_FFA1R_FFA7                      ((u16)0x0080)            /* Filter FIFO Assignment for Filter 7 */
#define  CAN_FFA1R_FFA8                      ((u16)0x0100)            /* Filter FIFO Assignment for Filter 8 */
#define  CAN_FFA1R_FFA9                      ((u16)0x0200)            /* Filter FIFO Assignment for Filter 9 */
#define  CAN_FFA1R_FFA10                     ((u16)0x0400)            /* Filter FIFO Assignment for Filter 10 */
#define  CAN_FFA1R_FFA11                     ((u16)0x0800)            /* Filter FIFO Assignment for Filter 11 */
#define  CAN_FFA1R_FFA12                     ((u16)0x1000)            /* Filter FIFO Assignment for Filter 12 */
#define  CAN_FFA1R_FFA13                     ((u16)0x2000)            /* Filter FIFO Assignment for Filter 13 */


/*******************  Bit definition for CAN_FA1R register  *******************/
#define  CAN_FA1R_FACT                       ((u16)0x3FFF)            /* Filter Active */
#define  CAN_FA1R_FACT0                      ((u16)0x0001)            /* Filter 0 Active */
#define  CAN_FA1R_FACT1                      ((u16)0x0002)            /* Filter 1 Active */
#define  CAN_FA1R_FACT2                      ((u16)0x0004)            /* Filter 2 Active */
#define  CAN_FA1R_FACT3                      ((u16)0x0008)            /* Filter 3 Active */
#define  CAN_FA1R_FACT4                      ((u16)0x0010)            /* Filter 4 Active */
#define  CAN_FA1R_FACT5                      ((u16)0x0020)            /* Filter 5 Active */
#define  CAN_FA1R_FACT6                      ((u16)0x0040)            /* Filter 6 Active */
#define  CAN_FA1R_FACT7                      ((u16)0x0080)            /* Filter 7 Active */
#define  CAN_FA1R_FACT8                      ((u16)0x0100)            /* Filter 8 Active */
#define  CAN_FA1R_FACT9                      ((u16)0x0200)            /* Filter 9 Active */
#define  CAN_FA1R_FACT10                     ((u16)0x0400)            /* Filter 10 Active */
#define  CAN_FA1R_FACT11                     ((u16)0x0800)            /* Filter 11 Active */
#define  CAN_FA1R_FACT12                     ((u16)0x1000)            /* Filter 12 Active */
#define  CAN_FA1R_FACT13                     ((u16)0x2000)            /* Filter 13 Active */


/*******************  Bit definition for CAN_F0R1 register  *******************/
#define  CAN_F0R1_FB0                        ((u32)0x00000001)        /* Filter bit 0 */
#define  CAN_F0R1_FB1                        ((u32)0x00000002)        /* Filter bit 1 */
#define  CAN_F0R1_FB2                        ((u32)0x00000004)        /* Filter bit 2 */
#define  CAN_F0R1_FB3                        ((u32)0x00000008)        /* Filter bit 3 */
#define  CAN_F0R1_FB4                        ((u32)0x00000010)        /* Filter bit 4 */
#define  CAN_F0R1_FB5                        ((u32)0x00000020)        /* Filter bit 5 */
#define  CAN_F0R1_FB6                        ((u32)0x00000040)        /* Filter bit 6 */
#define  CAN_F0R1_FB7                        ((u32)0x00000080)        /* Filter bit 7 */
#define  CAN_F0R1_FB8                        ((u32)0x00000100)        /* Filter bit 8 */
#define  CAN_F0R1_FB9                        ((u32)0x00000200)        /* Filter bit 9 */
#define  CAN_F0R1_FB10                       ((u32)0x00000400)        /* Filter bit 10 */
#define  CAN_F0R1_FB11                       ((u32)0x00000800)        /* Filter bit 11 */
#define  CAN_F0R1_FB12                       ((u32)0x00001000)        /* Filter bit 12 */
#define  CAN_F0R1_FB13                       ((u32)0x00002000)        /* Filter bit 13 */
#define  CAN_F0R1_FB14                       ((u32)0x00004000)        /* Filter bit 14 */
#define  CAN_F0R1_FB15                       ((u32)0x00008000)        /* Filter bit 15 */
#define  CAN_F0R1_FB16                       ((u32)0x00010000)        /* Filter bit 16 */
#define  CAN_F0R1_FB17                       ((u32)0x00020000)        /* Filter bit 17 */
#define  CAN_F0R1_FB18                       ((u32)0x00040000)        /* Filter bit 18 */
#define  CAN_F0R1_FB19                       ((u32)0x00080000)        /* Filter bit 19 */
#define  CAN_F0R1_FB20                       ((u32)0x00100000)        /* Filter bit 20 */
#define  CAN_F0R1_FB21                       ((u32)0x00200000)        /* Filter bit 21 */
#define  CAN_F0R1_FB22                       ((u32)0x00400000)        /* Filter bit 22 */
#define  CAN_F0R1_FB23                       ((u32)0x00800000)        /* Filter bit 23 */
#define  CAN_F0R1_FB24                       ((u32)0x01000000)        /* Filter bit 24 */
#define  CAN_F0R1_FB25                       ((u32)0x02000000)        /* Filter bit 25 */
#define  CAN_F0R1_FB26                       ((u32)0x04000000)        /* Filter bit 26 */
#define  CAN_F0R1_FB27                       ((u32)0x08000000)        /* Filter bit 27 */
#define  CAN_F0R1_FB28                       ((u32)0x10000000)        /* Filter bit 28 */
#define  CAN_F0R1_FB29                       ((u32)0x20000000)        /* Filter bit 29 */
#define  CAN_F0R1_FB30                       ((u32)0x40000000)        /* Filter bit 30 */
#define  CAN_F0R1_FB31                       ((u32)0x80000000)        /* Filter bit 31 */


/*******************  Bit definition for CAN_F1R1 register  *******************/
#define  CAN_F1R1_FB0                        ((u32)0x00000001)        /* Filter bit 0 */
#define  CAN_F1R1_FB1                        ((u32)0x00000002)        /* Filter bit 1 */
#define  CAN_F1R1_FB2                        ((u32)0x00000004)        /* Filter bit 2 */
#define  CAN_F1R1_FB3                        ((u32)0x00000008)        /* Filter bit 3 */
#define  CAN_F1R1_FB4                        ((u32)0x00000010)        /* Filter bit 4 */
#define  CAN_F1R1_FB5                        ((u32)0x00000020)        /* Filter bit 5 */
#define  CAN_F1R1_FB6                        ((u32)0x00000040)        /* Filter bit 6 */
#define  CAN_F1R1_FB7                        ((u32)0x00000080)        /* Filter bit 7 */
#define  CAN_F1R1_FB8                        ((u32)0x00000100)        /* Filter bit 8 */
#define  CAN_F1R1_FB9                        ((u32)0x00000200)        /* Filter bit 9 */
#define  CAN_F1R1_FB10                       ((u32)0x00000400)        /* Filter bit 10 */
#define  CAN_F1R1_FB11                       ((u32)0x00000800)        /* Filter bit 11 */
#define  CAN_F1R1_FB12                       ((u32)0x00001000)        /* Filter bit 12 */
#define  CAN_F1R1_FB13                       ((u32)0x00002000)        /* Filter bit 13 */
#define  CAN_F1R1_FB14                       ((u32)0x00004000)        /* Filter bit 14 */
#define  CAN_F1R1_FB15                       ((u32)0x00008000)        /* Filter bit 15 */
#define  CAN_F1R1_FB16                       ((u32)0x00010000)        /* Filter bit 16 */
#define  CAN_F1R1_FB17                       ((u32)0x00020000)        /* Filter bit 17 */
#define  CAN_F1R1_FB18                       ((u32)0x00040000)        /* Filter bit 18 */
#define  CAN_F1R1_FB19                       ((u32)0x00080000)        /* Filter bit 19 */
#define  CAN_F1R1_FB20                       ((u32)0x00100000)        /* Filter bit 20 */
#define  CAN_F1R1_FB21                       ((u32)0x00200000)        /* Filter bit 21 */
#define  CAN_F1R1_FB22                       ((u32)0x00400000)        /* Filter bit 22 */
#define  CAN_F1R1_FB23                       ((u32)0x00800000)        /* Filter bit 23 */
#define  CAN_F1R1_FB24                       ((u32)0x01000000)        /* Filter bit 24 */
#define  CAN_F1R1_FB25                       ((u32)0x02000000)        /* Filter bit 25 */
#define  CAN_F1R1_FB26                       ((u32)0x04000000)        /* Filter bit 26 */
#define  CAN_F1R1_FB27                       ((u32)0x08000000)        /* Filter bit 27 */
#define  CAN_F1R1_FB28                       ((u32)0x10000000)        /* Filter bit 28 */
#define  CAN_F1R1_FB29                       ((u32)0x20000000)        /* Filter bit 29 */
#define  CAN_F1R1_FB30                       ((u32)0x40000000)        /* Filter bit 30 */
#define  CAN_F1R1_FB31                       ((u32)0x80000000)        /* Filter bit 31 */


/*******************  Bit definition for CAN_F2R1 register  *******************/
#define  CAN_F2R1_FB0                        ((u32)0x00000001)        /* Filter bit 0 */
#define  CAN_F2R1_FB1                        ((u32)0x00000002)        /* Filter bit 1 */
#define  CAN_F2R1_FB2                        ((u32)0x00000004)        /* Filter bit 2 */
#define  CAN_F2R1_FB3                        ((u32)0x00000008)        /* Filter bit 3 */
#define  CAN_F2R1_FB4                        ((u32)0x00000010)        /* Filter bit 4 */
#define  CAN_F2R1_FB5                        ((u32)0x00000020)        /* Filter bit 5 */
#define  CAN_F2R1_FB6                        ((u32)0x00000040)        /* Filter bit 6 */
#define  CAN_F2R1_FB7                        ((u32)0x00000080)        /* Filter bit 7 */
#define  CAN_F2R1_FB8                        ((u32)0x00000100)        /* Filter bit 8 */
#define  CAN_F2R1_FB9                        ((u32)0x00000200)        /* Filter bit 9 */
#define  CAN_F2R1_FB10                       ((u32)0x00000400)        /* Filter bit 10 */
#define  CAN_F2R1_FB11                       ((u32)0x00000800)        /* Filter bit 11 */
#define  CAN_F2R1_FB12                       ((u32)0x00001000)        /* Filter bit 12 */
#define  CAN_F2R1_FB13                       ((u32)0x00002000)        /* Filter bit 13 */
#define  CAN_F2R1_FB14                       ((u32)0x00004000)        /* Filter bit 14 */
#define  CAN_F2R1_FB15                       ((u32)0x00008000)        /* Filter bit 15 */
#define  CAN_F2R1_FB16                       ((u32)0x00010000)        /* Filter bit 16 */
#define  CAN_F2R1_FB17                       ((u32)0x00020000)        /* Filter bit 17 */
#define  CAN_F2R1_FB18                       ((u32)0x00040000)        /* Filter bit 18 */
#define  CAN_F2R1_FB19                       ((u32)0x00080000)        /* Filter bit 19 */
#define  CAN_F2R1_FB20                       ((u32)0x00100000)        /* Filter bit 20 */
#define  CAN_F2R1_FB21                       ((u32)0x00200000)        /* Filter bit 21 */
#define  CAN_F2R1_FB22                       ((u32)0x00400000)        /* Filter bit 22 */
#define  CAN_F2R1_FB23                       ((u32)0x00800000)        /* Filter bit 23 */
#define  CAN_F2R1_FB24                       ((u32)0x01000000)        /* Filter bit 24 */
#define  CAN_F2R1_FB25                       ((u32)0x02000000)        /* Filter bit 25 */
#define  CAN_F2R1_FB26                       ((u32)0x04000000)        /* Filter bit 26 */
#define  CAN_F2R1_FB27                       ((u32)0x08000000)        /* Filter bit 27 */
#define  CAN_F2R1_FB28                       ((u32)0x10000000)        /* Filter bit 28 */
#define  CAN_F2R1_FB29                       ((u32)0x20000000)        /* Filter bit 29 */
#define  CAN_F2R1_FB30                       ((u32)0x40000000)        /* Filter bit 30 */
#define  CAN_F2R1_FB31                       ((u32)0x80000000)        /* Filter bit 31 */


/*******************  Bit definition for CAN_F3R1 register  *******************/
#define  CAN_F3R1_FB0                        ((u32)0x00000001)        /* Filter bit 0 */
#define  CAN_F3R1_FB1                        ((u32)0x00000002)        /* Filter bit 1 */
#define  CAN_F3R1_FB2                        ((u32)0x00000004)        /* Filter bit 2 */
#define  CAN_F3R1_FB3                        ((u32)0x00000008)        /* Filter bit 3 */
#define  CAN_F3R1_FB4                        ((u32)0x00000010)        /* Filter bit 4 */
#define  CAN_F3R1_FB5                        ((u32)0x00000020)        /* Filter bit 5 */
#define  CAN_F3R1_FB6                        ((u32)0x00000040)        /* Filter bit 6 */
#define  CAN_F3R1_FB7                        ((u32)0x00000080)        /* Filter bit 7 */
#define  CAN_F3R1_FB8                        ((u32)0x00000100)        /* Filter bit 8 */
#define  CAN_F3R1_FB9                        ((u32)0x00000200)        /* Filter bit 9 */
#define  CAN_F3R1_FB10                       ((u32)0x00000400)        /* Filter bit 10 */
#define  CAN_F3R1_FB11                       ((u32)0x00000800)        /* Filter bit 11 */
#define  CAN_F3R1_FB12                       ((u32)0x00001000)        /* Filter bit 12 */
#define  CAN_F3R1_FB13                       ((u32)0x00002000)        /* Filter bit 13 */
#define  CAN_F3R1_FB14                       ((u32)0x00004000)        /* Filter bit 14 */
#define  CAN_F3R1_FB15                       ((u32)0x00008000)        /* Filter bit 15 */
#define  CAN_F3R1_FB16                       ((u32)0x00010000)        /* Filter bit 16 */
#define  CAN_F3R1_FB17                       ((u32)0x00020000)        /* Filter bit 17 */
#define  CAN_F3R1_FB18                       ((u32)0x00040000)        /* Filter bit 18 */
#define  CAN_F3R1_FB19                       ((u32)0x00080000)        /* Filter bit 19 */
#define  CAN_F3R1_FB20                       ((u32)0x00100000)        /* Filter bit 20 */
#define  CAN_F3R1_FB21                       ((u32)0x00200000)        /* Filter bit 21 */
#define  CAN_F3R1_FB22                       ((u32)0x00400000)        /* Filter bit 22 */
#define  CAN_F3R1_FB23                       ((u32)0x00800000)        /* Filter bit 23 */
#define  CAN_F3R1_FB24                       ((u32)0x01000000)        /* Filter bit 24 */
#define  CAN_F3R1_FB25                       ((u32)0x02000000)        /* Filter bit 25 */
#define  CAN_F3R1_FB26                       ((u32)0x04000000)        /* Filter bit 26 */
#define  CAN_F3R1_FB27                       ((u32)0x08000000)        /* Filter bit 27 */
#define  CAN_F3R1_FB28                       ((u32)0x10000000)        /* Filter bit 28 */
#define  CAN_F3R1_FB29                       ((u32)0x20000000)        /* Filter bit 29 */
#define  CAN_F3R1_FB30                       ((u32)0x40000000)        /* Filter bit 30 */
#define  CAN_F3R1_FB31                       ((u32)0x80000000)        /* Filter bit 31 */


