RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/*******************  Bit definition for CAN_F12R2 register  ******************/
#define  CAN_F12R2_FB0                       ((u32)0x00000001)        /* Filter bit 0 */
#define  CAN_F12R2_FB1                       ((u32)0x00000002)        /* Filter bit 1 */
#define  CAN_F12R2_FB2                       ((u32)0x00000004)        /* Filter bit 2 */
#define  CAN_F12R2_FB3                       ((u32)0x00000008)        /* Filter bit 3 */
#define  CAN_F12R2_FB4                       ((u32)0x00000010)        /* Filter bit 4 */
#define  CAN_F12R2_FB5                       ((u32)0x00000020)        /* Filter bit 5 */
#define  CAN_F12R2_FB6                       ((u32)0x00000040)        /* Filter bit 6 */
#define  CAN_F12R2_FB7                       ((u32)0x00000080)        /* Filter bit 7 */
#define  CAN_F12R2_FB8                       ((u32)0x00000100)        /* Filter bit 8 */
#define  CAN_F12R2_FB9                       ((u32)0x00000200)        /* Filter bit 9 */
#define  CAN_F12R2_FB10                      ((u32)0x00000400)        /* Filter bit 10 */
#define  CAN_F12R2_FB11                      ((u32)0x00000800)        /* Filter bit 11 */
#define  CAN_F12R2_FB12                      ((u32)0x00001000)        /* Filter bit 12 */
#define  CAN_F12R2_FB13                      ((u32)0x00002000)        /* Filter bit 13 */
#define  CAN_F12R2_FB14                      ((u32)0x00004000)        /* Filter bit 14 */
#define  CAN_F12R2_FB15                      ((u32)0x00008000)        /* Filter bit 15 */
#define  CAN_F12R2_FB16                      ((u32)0x00010000)        /* Filter bit 16 */
#define  CAN_F12R2_FB17                      ((u32)0x00020000)        /* Filter bit 17 */
#define  CAN_F12R2_FB18                      ((u32)0x00040000)        /* Filter bit 18 */
#define  CAN_F12R2_FB19                      ((u32)0x00080000)        /* Filter bit 19 */
#define  CAN_F12R2_FB20                      ((u32)0x00100000)        /* Filter bit 20 */
#define  CAN_F12R2_FB21                      ((u32)0x00200000)        /* Filter bit 21 */
#define  CAN_F12R2_FB22                      ((u32)0x00400000)        /* Filter bit 22 */
#define  CAN_F12R2_FB23                      ((u32)0x00800000)        /* Filter bit 23 */
#define  CAN_F12R2_FB24                      ((u32)0x01000000)        /* Filter bit 24 */
#define  CAN_F12R2_FB25                      ((u32)0x02000000)        /* Filter bit 25 */
#define  CAN_F12R2_FB26                      ((u32)0x04000000)        /* Filter bit 26 */
#define  CAN_F12R2_FB27                      ((u32)0x08000000)        /* Filter bit 27 */
#define  CAN_F12R2_FB28                      ((u32)0x10000000)        /* Filter bit 28 */
#define  CAN_F12R2_FB29                      ((u32)0x20000000)        /* Filter bit 29 */
#define  CAN_F12R2_FB30                      ((u32)0x40000000)        /* Filter bit 30 */
#define  CAN_F12R2_FB31                      ((u32)0x80000000)        /* Filter bit 31 */


/*******************  Bit definition for CAN_F13R2 register  ******************/
#define  CAN_F13R2_FB0                       ((u32)0x00000001)        /* Filter bit 0 */
#define  CAN_F13R2_FB1                       ((u32)0x00000002)        /* Filter bit 1 */
#define  CAN_F13R2_FB2                       ((u32)0x00000004)        /* Filter bit 2 */
#define  CAN_F13R2_FB3                       ((u32)0x00000008)        /* Filter bit 3 */
#define  CAN_F13R2_FB4                       ((u32)0x00000010)        /* Filter bit 4 */
#define  CAN_F13R2_FB5                       ((u32)0x00000020)        /* Filter bit 5 */
#define  CAN_F13R2_FB6                       ((u32)0x00000040)        /* Filter bit 6 */
#define  CAN_F13R2_FB7                       ((u32)0x00000080)        /* Filter bit 7 */
#define  CAN_F13R2_FB8                       ((u32)0x00000100)        /* Filter bit 8 */
#define  CAN_F13R2_FB9                       ((u32)0x00000200)        /* Filter bit 9 */
#define  CAN_F13R2_FB10                      ((u32)0x00000400)        /* Filter bit 10 */
#define  CAN_F13R2_FB11                      ((u32)0x00000800)        /* Filter bit 11 */
#define  CAN_F13R2_FB12                      ((u32)0x00001000)        /* Filter bit 12 */
#define  CAN_F13R2_FB13                      ((u32)0x00002000)        /* Filter bit 13 */
#define  CAN_F13R2_FB14                      ((u32)0x00004000)        /* Filter bit 14 */
#define  CAN_F13R2_FB15                      ((u32)0x00008000)        /* Filter bit 15 */
#define  CAN_F13R2_FB16                      ((u32)0x00010000)        /* Filter bit 16 */
#define  CAN_F13R2_FB17                      ((u32)0x00020000)        /* Filter bit 17 */
#define  CAN_F13R2_FB18                      ((u32)0x00040000)        /* Filter bit 18 */
#define  CAN_F13R2_FB19                      ((u32)0x00080000)        /* Filter bit 19 */
#define  CAN_F13R2_FB20                      ((u32)0x00100000)        /* Filter bit 20 */
#define  CAN_F13R2_FB21                      ((u32)0x00200000)        /* Filter bit 21 */
#define  CAN_F13R2_FB22                      ((u32)0x00400000)        /* Filter bit 22 */
#define  CAN_F13R2_FB23                      ((u32)0x00800000)        /* Filter bit 23 */
#define  CAN_F13R2_FB24                      ((u32)0x01000000)        /* Filter bit 24 */
#define  CAN_F13R2_FB25                      ((u32)0x02000000)        /* Filter bit 25 */
#define  CAN_F13R2_FB26                      ((u32)0x04000000)        /* Filter bit 26 */
#define  CAN_F13R2_FB27                      ((u32)0x08000000)        /* Filter bit 27 */
#define  CAN_F13R2_FB28                      ((u32)0x10000000)        /* Filter bit 28 */
#define  CAN_F13R2_FB29                      ((u32)0x20000000)        /* Filter bit 29 */
#define  CAN_F13R2_FB30                      ((u32)0x40000000)        /* Filter bit 30 */
#define  CAN_F13R2_FB31                      ((u32)0x80000000)        /* Filter bit 31 */



/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SPI_CR1 register  ********************/
#define  SPI_CR1_CPHA                        ((u16)0x0001)            /* Clock Phase */
#define  SPI_CR1_CPOL                        ((u16)0x0002)            /* Clock Polarity */
#define  SPI_CR1_MSTR                        ((u16)0x0004)            /* Master Selection */

#define  SPI_CR1_BR                          ((u16)0x0038)            /* BR[2:0] bits (Baud Rate Control) */
#define  SPI_CR1_BR_0                        ((u16)0x0008)            /* Bit 0 */
#define  SPI_CR1_BR_1                        ((u16)0x0010)            /* Bit 1 */
#define  SPI_CR1_BR_2                        ((u16)0x0020)            /* Bit 2 */

#define  SPI_CR1_SPE                         ((u16)0x0040)            /* SPI Enable */
#define  SPI_CR1_LSBFIRST                    ((u16)0x0080)            /* Frame Format */
#define  SPI_CR1_SSI                         ((u16)0x0100)            /* Internal slave select */
#define  SPI_CR1_SSM                         ((u16)0x0200)            /* Software slave management */
#define  SPI_CR1_RXONLY                      ((u16)0x0400)            /* Receive only */
#define  SPI_CR1_DFF                         ((u16)0x0800)            /* Data Frame Format */
#define  SPI_CR1_CRCNEXT                     ((u16)0x1000)            /* Transmit CRC next */
#define  SPI_CR1_CRCEN                       ((u16)0x2000)            /* Hardware CRC calculation enable */
#define  SPI_CR1_BIDIOE                      ((u16)0x4000)            /* Output enable in bidirectional mode */
#define  SPI_CR1_BIDIMODE                    ((u16)0x8000)            /* Bidirectional data mode enable */


