RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/*******************  Bit definition for SPI_CR2 register  ********************/
#define  SPI_CR2_RXDMAEN                     ((u8)0x01)               /* Rx Buffer DMA Enable */
#define  SPI_CR2_TXDMAEN                     ((u8)0x02)               /* Tx Buffer DMA Enable */
#define  SPI_CR2_SSOE                        ((u8)0x04)               /* SS Output Enable */
#define  SPI_CR2_ERRIE                       ((u8)0x20)               /* Error Interrupt Enable */
#define  SPI_CR2_RXNEIE                      ((u8)0x40)               /* RX buffer Not Empty Interrupt Enable */
#define  SPI_CR2_TXEIE                       ((u8)0x80)               /* Tx buffer Empty Interrupt Enable */


/********************  Bit definition for SPI_SR register  ********************/
#define  SPI_SR_RXNE                         ((u8)0x01)               /* Receive buffer Not Empty */
#define  SPI_SR_TXE                          ((u8)0x02)               /* Transmit buffer Empty */
#define  SPI_SR_CHSIDE                       ((u8)0x04)               /* Channel side */
#define  SPI_SR_UDR                          ((u8)0x08)               /* Underrun flag */
#define  SPI_SR_CRCERR                       ((u8)0x10)               /* CRC Error flag */
#define  SPI_SR_MODF                         ((u8)0x20)               /* Mode fault */
#define  SPI_SR_OVR                          ((u8)0x40)               /* Overrun flag */
#define  SPI_SR_BSY                          ((u8)0x80)               /* Busy flag */


/********************  Bit definition for SPI_DR register  ********************/
#define  SPI_DR_DR                           ((u16)0xFFFF)            /* Data Register */


/*******************  Bit definition for SPI_CRCPR register  ******************/
#define  SPI_CRCPR_CRCPOLY                   ((u16)0xFFFF)            /* CRC polynomial register */


/******************  Bit definition for SPI_RXCRCR register  ******************/
#define  SPI_RXCRCR_RXCRC                    ((u16)0xFFFF)            /* Rx CRC Register */


/******************  Bit definition for SPI_TXCRCR register  ******************/
#define  SPI_TXCRCR_TXCRC                    ((u16)0xFFFF)            /* Tx CRC Register */


/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define  SPI_I2SCFGR_CHLEN                   ((u16)0x0001)            /* Channel length (number of bits per audio channel) */

#define  SPI_I2SCFGR_DATLEN                  ((u16)0x0006)            /* DATLEN[1:0] bits (Data length to be transferred) */
#define  SPI_I2SCFGR_DATLEN_0                ((u16)0x0002)            /* Bit 0 */
#define  SPI_I2SCFGR_DATLEN_1                ((u16)0x0004)            /* Bit 1 */

#define  SPI_I2SCFGR_CKPOL                   ((u16)0x0008)            /* steady state clock polarity */

#define  SPI_I2SCFGR_I2SSTD                  ((u16)0x0030)            /* I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCFGR_I2SSTD_0                ((u16)0x0010)            /* Bit 0 */
#define  SPI_I2SCFGR_I2SSTD_1                ((u16)0x0020)            /* Bit 1 */

#define  SPI_I2SCFGR_PCMSYNC                 ((u16)0x0080)            /* PCM frame synchronization */

#define  SPI_I2SCFGR_I2SCFG                  ((u16)0x0300)            /* I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCFGR_I2SCFG_0                ((u16)0x0100)            /* Bit 0 */
#define  SPI_I2SCFGR_I2SCFG_1                ((u16)0x0200)            /* Bit 1 */

#define  SPI_I2SCFGR_I2SE                    ((u16)0x0400)            /* I2S Enable */
#define  SPI_I2SCFGR_I2SMOD                  ((u16)0x0800)            /* I2S mode selection */


/******************  Bit definition for SPI_I2SPR register  *******************/
#define  SPI_I2SPR_I2SDIV                    ((u16)0x00FF)            /* I2S Linear prescaler */
#define  SPI_I2SPR_ODD                       ((u16)0x0100)            /* Odd factor for the prescaler */
#define  SPI_I2SPR_MCKOE                     ((u16)0x0200)            /* Master Clock Output Enable */



/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CR1 register  ********************/
#define  I2C_CR1_PE                          ((u16)0x0001)            /* Peripheral Enable */
#define  I2C_CR1_SMBUS                       ((u16)0x0002)            /* SMBus Mode */
#define  I2C_CR1_SMBTYPE                     ((u16)0x0008)            /* SMBus Type */
#define  I2C_CR1_ENARP                       ((u16)0x0010)            /* ARP Enable */
#define  I2C_CR1_ENPEC                       ((u16)0x0020)            /* PEC Enable */
#define  I2C_CR1_ENGC                        ((u16)0x0040)            /* General Call Enable */
#define  I2C_CR1_NOSTRETCH                   ((u16)0x0080)            /* Clock Stretching Disable (Slave mode) */
#define  I2C_CR1_START                       ((u16)0x0100)            /* Start Generation */
#define  I2C_CR1_STOP                        ((u16)0x0200)            /* Stop Generation */
#define  I2C_CR1_ACK                         ((u16)0x0400)            /* Acknowledge Enable */
#define  I2C_CR1_POS                         ((u16)0x0800)            /* Acknowledge/PEC Position (for data reception) */
#define  I2C_CR1_PEC                         ((u16)0x1000)            /* Packet Error Checking */
#define  I2C_CR1_ALERT                       ((u16)0x2000)            /* SMBus Alert */
#define  I2C_CR1_SWRST                       ((u16)0x8000)            /* Software Reset */


/*******************  Bit definition for I2C_CR2 register  ********************/
#define  I2C_CR2_FREQ                        ((u16)0x003F)            /* FREQ[5:0] bits (Peripheral Clock Frequency) */
#define  I2C_CR2_FREQ_0                      ((u16)0x0001)            /* Bit 0 */
#define  I2C_CR2_FREQ_1                      ((u16)0x0002)            /* Bit 1 */
#define  I2C_CR2_FREQ_2                      ((u16)0x0004)            /* Bit 2 */
#define  I2C_CR2_FREQ_3                      ((u16)0x0008)            /* Bit 3 */
#define  I2C_CR2_FREQ_4                      ((u16)0x0010)            /* Bit 4 */
#define  I2C_CR2_FREQ_5                      ((u16)0x0020)            /* Bit 5 */

#define  I2C_CR2_ITERREN                     ((u16)0x0100)            /* Error Interrupt Enable */
#define  I2C_CR2_ITEVTEN                     ((u16)0x0200)            /* Event Interrupt Enable */
#define  I2C_CR2_ITBUFEN                     ((u16)0x0400)            /* Buffer Interrupt Enable */
#define  I2C_CR2_DMAEN                       ((u16)0x0800)            /* DMA Requests Enable */
#define  I2C_CR2_LAST                        ((u16)0x1000)            /* DMA Last Transfer */


/*******************  Bit definition for I2C_OAR1 register  *******************/
#define  I2C_OAR1_ADD1_7                     ((u16)0x00FE)            /* Interface Address */
#define  I2C_OAR1_ADD8_9                     ((u16)0x0300)            /* Interface Address */

#define  I2C_OAR1_ADD0                       ((u16)0x0001)            /* Bit 0 */
#define  I2C_OAR1_ADD1                       ((u16)0x0002)            /* Bit 1 */
#define  I2C_OAR1_ADD2                       ((u16)0x0004)            /* Bit 2 */
#define  I2C_OAR1_ADD3                       ((u16)0x0008)            /* Bit 3 */
#define  I2C_OAR1_ADD4                       ((u16)0x0010)            /* Bit 4 */
#define  I2C_OAR1_ADD5                       ((u16)0x0020)            /* Bit 5 */
#define  I2C_OAR1_ADD6                       ((u16)0x0040)            /* Bit 6 */
#define  I2C_OAR1_ADD7                       ((u16)0x0080)            /* Bit 7 */
#define  I2C_OAR1_ADD8                       ((u16)0x0100)            /* Bit 8 */
#define  I2C_OAR1_ADD9                       ((u16)0x0200)            /* Bit 9 */

#define  I2C_OAR1_ADDMODE                    ((u16)0x8000)            /* Addressing Mode (Slave mode) */


/*******************  Bit definition for I2C_OAR2 register  *******************/
#define  I2C_OAR2_ENDUAL                     ((u8)0x01)               /* Dual addressing mode enable */
#define  I2C_OAR2_ADD2                       ((u8)0xFE)               /* Interface address */


