RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/********************  Bit definition for I2C_DR register  ********************/
#define  I2C_DR_DR                           ((u8)0xFF)               /* 8-bit Data Register */


/*******************  Bit definition for I2C_SR1 register  ********************/
#define  I2C_SR1_SB                          ((u16)0x0001)            /* Start Bit (Master mode) */
#define  I2C_SR1_ADDR                        ((u16)0x0002)            /* Address sent (master mode)/matched (slave mode) */
#define  I2C_SR1_BTF                         ((u16)0x0004)            /* Byte Transfer Finished */
#define  I2C_SR1_ADD10                       ((u16)0x0008)            /* 10-bit header sent (Master mode) */
#define  I2C_SR1_STOPF                       ((u16)0x0010)            /* Stop detection (Slave mode) */
#define  I2C_SR1_RXNE                        ((u16)0x0040)            /* Data Register not Empty (receivers) */
#define  I2C_SR1_TXE                         ((u16)0x0080)            /* Data Register Empty (transmitters) */
#define  I2C_SR1_BERR                        ((u16)0x0100)            /* Bus Error */
#define  I2C_SR1_ARLO                        ((u16)0x0200)            /* Arbitration Lost (master mode) */
#define  I2C_SR1_AF                          ((u16)0x0400)            /* Acknowledge Failure */
#define  I2C_SR1_OVR                         ((u16)0x0800)            /* Overrun/Underrun */
#define  I2C_SR1_PECERR                      ((u16)0x1000)            /* PEC Error in reception */
#define  I2C_SR1_TIMEOUT                     ((u16)0x4000)            /* Timeout or Tlow Error */
#define  I2C_SR1_SMBALERT                    ((u16)0x8000)            /* SMBus Alert */


/*******************  Bit definition for I2C_SR2 register  ********************/
#define  I2C_SR2_MSL                         ((u16)0x0001)            /* Master/Slave */
#define  I2C_SR2_BUSY                        ((u16)0x0002)            /* Bus Busy */
#define  I2C_SR2_TRA                         ((u16)0x0004)            /* Transmitter/Receiver */
#define  I2C_SR2_GENCALL                     ((u16)0x0010)            /* General Call Address (Slave mode) */
#define  I2C_SR2_SMBDEFAULT                  ((u16)0x0020)            /* SMBus Device Default Address (Slave mode) */
#define  I2C_SR2_SMBHOST                     ((u16)0x0040)            /* SMBus Host Header (Slave mode) */
#define  I2C_SR2_DUALF                       ((u16)0x0080)            /* Dual Flag (Slave mode) */
#define  I2C_SR2_PEC                         ((u16)0xFF00)            /* Packet Error Checking Register */


/*******************  Bit definition for I2C_CCR register  ********************/
#define  I2C_CCR_CCR                         ((u16)0x0FFF)            /* Clock Control Register in Fast/Standard mode (Master mode) */
#define  I2C_CCR_DUTY                        ((u16)0x4000)            /* Fast Mode Duty Cycle */
#define  I2C_CCR_FS                          ((u16)0x8000)            /* I2C Master Mode Selection */


/******************  Bit definition for I2C_TRISE register  *******************/
#define  I2C_TRISE_TRISE                     ((u8)0x3F)               /* Maximum Rise Time in Fast/Standard mode (Master mode) */



/******************************************************************************/
/*                                                                            */
/*          Universal Synchronous Asynchronous Receiver Transmitter           */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for USART_SR register  *******************/
#define  USART_SR_PE                         ((u16)0x0001)            /* Parity Error */
#define  USART_SR_FE                         ((u16)0x0002)            /* Framing Error */
#define  USART_SR_NE                         ((u16)0x0004)            /* Noise Error Flag */
#define  USART_SR_ORE                        ((u16)0x0008)            /* OverRun Error */
#define  USART_SR_IDLE                       ((u16)0x0010)            /* IDLE line detected */
#define  USART_SR_RXNE                       ((u16)0x0020)            /* Read Data Register Not Empty */
#define  USART_SR_TC                         ((u16)0x0040)            /* Transmission Complete */
#define  USART_SR_TXE                        ((u16)0x0080)            /* Transmit Data Register Empty */
#define  USART_SR_LBD                        ((u16)0x0100)            /* LIN Break Detection Flag */
#define  USART_SR_CTS                        ((u16)0x0200)            /* CTS Flag */


/*******************  Bit definition for USART_DR register  *******************/
#define  USART_DR_DR                         ((u16)0x01FF)            /* Data value */


/******************  Bit definition for USART_BRR register  *******************/
#define  USART_BRR_DIV_Fraction              ((u16)0x000F)            /* Fraction of USARTDIV */
#define  USART_BRR_DIV_Mantissa              ((u16)0xFFF0)            /* Mantissa of USARTDIV */


/******************  Bit definition for USART_CR1 register  *******************/
#define  USART_CR1_SBK                       ((u16)0x0001)            /* Send Break */
#define  USART_CR1_RWU                       ((u16)0x0002)            /* Receiver wakeup */
#define  USART_CR1_RE                        ((u16)0x0004)            /* Receiver Enable */
#define  USART_CR1_TE                        ((u16)0x0008)            /* Transmitter Enable */
#define  USART_CR1_IDLEIE                    ((u16)0x0010)            /* IDLE Interrupt Enable */
#define  USART_CR1_RXNEIE                    ((u16)0x0020)            /* RXNE Interrupt Enable */
#define  USART_CR1_TCIE                      ((u16)0x0040)            /* Transmission Complete Interrupt Enable */
#define  USART_CR1_TXEIE                     ((u16)0x0080)            /* PE Interrupt Enable */
#define  USART_CR1_PEIE                      ((u16)0x0100)            /* PE Interrupt Enable */
#define  USART_CR1_PS                        ((u16)0x0200)            /* Parity Selection */
#define  USART_CR1_PCE                       ((u16)0x0400)            /* Parity Control Enable */
#define  USART_CR1_WAKE                      ((u16)0x0800)            /* Wakeup method */
#define  USART_CR1_M                         ((u16)0x1000)            /* Word length */
#define  USART_CR1_UE                        ((u16)0x2000)            /* USART Enable */


