RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
/******************  Bit definition for USART_CR2 register  *******************/
#define  USART_CR2_ADD                       ((u16)0x000F)            /* Address of the USART node */
#define  USART_CR2_LBDL                      ((u16)0x0020)            /* LIN Break Detection Length */
#define  USART_CR2_LBDIE                     ((u16)0x0040)            /* LIN Break Detection Interrupt Enable */
#define  USART_CR2_LBCL                      ((u16)0x0100)            /* Last Bit Clock pulse */
#define  USART_CR2_CPHA                      ((u16)0x0200)            /* Clock Phase */
#define  USART_CR2_CPOL                      ((u16)0x0400)            /* Clock Polarity */
#define  USART_CR2_CLKEN                     ((u16)0x0800)            /* Clock Enable */

#define  USART_CR2_STOP                      ((u16)0x3000)            /* STOP[1:0] bits (STOP bits) */
#define  USART_CR2_STOP_0                    ((u16)0x1000)            /* Bit 0 */
#define  USART_CR2_STOP_1                    ((u16)0x2000)            /* Bit 1 */

#define  USART_CR2_LINEN                     ((u16)0x4000)            /* LIN mode enable */


/******************  Bit definition for USART_CR3 register  *******************/
#define  USART_CR3_EIE                       ((u16)0x0001)            /* Error Interrupt Enable */
#define  USART_CR3_IREN                      ((u16)0x0002)            /* IrDA mode Enable */
#define  USART_CR3_IRLP                      ((u16)0x0004)            /* IrDA Low-Power */
#define  USART_CR3_HDSEL                     ((u16)0x0008)            /* Half-Duplex Selection */
#define  USART_CR3_NACK                      ((u16)0x0010)            /* Smartcard NACK enable */
#define  USART_CR3_SCEN                      ((u16)0x0020)            /* Smartcard mode enable */
#define  USART_CR3_DMAR                      ((u16)0x0040)            /* DMA Enable Receiver */
#define  USART_CR3_DMAT                      ((u16)0x0080)            /* DMA Enable Transmitter */
#define  USART_CR3_RTSE                      ((u16)0x0100)            /* RTS Enable */
#define  USART_CR3_CTSE                      ((u16)0x0200)            /* CTS Enable */
#define  USART_CR3_CTSIE                     ((u16)0x0400)            /* CTS Interrupt Enable */


/******************  Bit definition for USART_GTPR register  ******************/
#define  USART_GTPR_PSC                      ((u16)0x00FF)            /* PSC[7:0] bits (Prescaler value) */
#define  USART_GTPR_PSC_0                    ((u16)0x0001)            /* Bit 0 */
#define  USART_GTPR_PSC_1                    ((u16)0x0002)            /* Bit 1 */
#define  USART_GTPR_PSC_2                    ((u16)0x0004)            /* Bit 2 */
#define  USART_GTPR_PSC_3                    ((u16)0x0008)            /* Bit 3 */
#define  USART_GTPR_PSC_4                    ((u16)0x0010)            /* Bit 4 */
#define  USART_GTPR_PSC_5                    ((u16)0x0020)            /* Bit 5 */
#define  USART_GTPR_PSC_6                    ((u16)0x0040)            /* Bit 6 */
#define  USART_GTPR_PSC_7                    ((u16)0x0080)            /* Bit 7 */

#define  USART_GTPR_GT                       ((u16)0xFF00)            /* Guard time value */



/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for DBGMCU_IDCODE register  *****************/
#define  DBGMCU_IDCODE_DEV_ID                ((u32)0x00000FFF)        /* Device Identifier */

#define  DBGMCU_IDCODE_REV_ID                ((u32)0xFFFF0000)        /* REV_ID[15:0] bits (Revision Identifier) */
#define  DBGMCU_IDCODE_REV_ID_0              ((u32)0x00010000)        /* Bit 0 */
#define  DBGMCU_IDCODE_REV_ID_1              ((u32)0x00020000)        /* Bit 1 */
#define  DBGMCU_IDCODE_REV_ID_2              ((u32)0x00040000)        /* Bit 2 */
#define  DBGMCU_IDCODE_REV_ID_3              ((u32)0x00080000)        /* Bit 3 */
#define  DBGMCU_IDCODE_REV_ID_4              ((u32)0x00100000)        /* Bit 4 */
#define  DBGMCU_IDCODE_REV_ID_5              ((u32)0x00200000)        /* Bit 5 */
#define  DBGMCU_IDCODE_REV_ID_6              ((u32)0x00400000)        /* Bit 6 */
#define  DBGMCU_IDCODE_REV_ID_7              ((u32)0x00800000)        /* Bit 7 */
#define  DBGMCU_IDCODE_REV_ID_8              ((u32)0x01000000)        /* Bit 8 */
#define  DBGMCU_IDCODE_REV_ID_9              ((u32)0x02000000)        /* Bit 9 */
#define  DBGMCU_IDCODE_REV_ID_10             ((u32)0x04000000)        /* Bit 10 */
#define  DBGMCU_IDCODE_REV_ID_11             ((u32)0x08000000)        /* Bit 11 */
#define  DBGMCU_IDCODE_REV_ID_12             ((u32)0x10000000)        /* Bit 12 */
#define  DBGMCU_IDCODE_REV_ID_13             ((u32)0x20000000)        /* Bit 13 */
#define  DBGMCU_IDCODE_REV_ID_14             ((u32)0x40000000)        /* Bit 14 */
#define  DBGMCU_IDCODE_REV_ID_15             ((u32)0x80000000)        /* Bit 15 */


/******************  Bit definition for DBGMCU_CR register  *******************/
#define  DBGMCU_CR_DBG_SLEEP                 ((u32)0x00000001)        /* Debug Sleep Mode */
#define  DBGMCU_CR_DBG_STOP                  ((u32)0x00000002)        /* Debug Stop Mode */
#define  DBGMCU_CR_DBG_STANDBY               ((u32)0x00000004)        /* Debug Standby mode */
#define  DBGMCU_CR_TRACE_IOEN                ((u32)0x00000020)        /* Trace Pin Assignment Control */

#define  DBGMCU_CR_TRACE_MODE                ((u32)0x000000C0)        /* TRACE_MODE[1:0] bits (Trace Pin Assignment Control) */
#define  DBGMCU_CR_TRACE_MODE_0              ((u32)0x00000040)        /* Bit 0 */
#define  DBGMCU_CR_TRACE_MODE_1              ((u32)0x00000080)        /* Bit 1 */

