RT-Thread/rt-thread/bsp/stm32sky001/library/inc/stm32f10x_map.h
#define  DBGMCU_CR_DBG_IWDG_STOP             ((u32)0x00000100)        /* Debug Independent Watchdog stopped when Core is halted */
#define  DBGMCU_CR_DBG_WWDG_STOP             ((u32)0x00000200)        /* Debug Window Watchdog stopped when Core is halted */
#define  DBGMCU_CR_DBG_TIM1_STOP             ((u32)0x00000400)        /* TIM1 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM2_STOP             ((u32)0x00000800)        /* TIM2 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM3_STOP             ((u32)0x00001000)        /* TIM3 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM4_STOP             ((u32)0x00002000)        /* TIM4 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_CAN_STOP              ((u32)0x00004000)        /* Debug CAN stopped when Core is halted */
#define  DBGMCU_CR_DBG_I2C1_SMBUS_TIMEOUT    ((u32)0x00008000)        /* SMBUS timeout mode stopped when Core is halted */
#define  DBGMCU_CR_DBG_I2C2_SMBUS_TIMEOUT    ((u32)0x00010000)        /* SMBUS timeout mode stopped when Core is halted */
#define  DBGMCU_CR_DBG_TIM5_STOP             ((u32)0x00020000)        /* TIM5 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM6_STOP             ((u32)0x00040000)        /* TIM6 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM7_STOP             ((u32)0x00080000)        /* TIM7 counter stopped when core is halted */
#define  DBGMCU_CR_DBG_TIM8_STOP             ((u32)0x00100000)        /* TIM8 counter stopped when core is halted */



/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define  FLASH_ACR_LATENCY                   ((u8)0x07)               /* LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                 ((u8)0x01)               /* Bit 0 */
#define  FLASH_ACR_LATENCY_1                 ((u8)0x02)               /* Bit 1 */
#define  FLASH_ACR_LATENCY_2                 ((u8)0x04)               /* Bit 2 */
  
#define  FLASH_ACR_HLFCYA                    ((u8)0x08)               /* Flash Half Cycle Access Enable */
#define  FLASH_ACR_PRFTBE                    ((u8)0x10)               /* Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    ((u8)0x20)               /* Prefetch Buffer Status */


/******************  Bit definition for FLASH_KEYR register  ******************/
#define  FLASH_KEYR_FKEYR                    ((u32)0xFFFFFFFF)        /* FPEC Key */


/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define  FLASH_OPTKEYR_OPTKEYR               ((u32)0xFFFFFFFF)        /* Option Byte Key */


/******************  Bit definition for FLASH_SR register  *******************/
#define  FLASH_SR_BSY                        ((u8)0x01)               /* Busy */
#define  FLASH_SR_PGERR                      ((u8)0x04)               /* Programming Error */
#define  FLASH_SR_WRPRTERR                   ((u8)0x10)               /* Write Protection Error */
#define  FLASH_SR_EOP                        ((u8)0x20)               /* End of operation */


/*******************  Bit definition for FLASH_CR register  *******************/
#define  FLASH_CR_PG                         ((u16)0x0001)            /* Programming */
#define  FLASH_CR_PER                        ((u16)0x0002)            /* Page Erase */
#define  FLASH_CR_MER                        ((u16)0x0004)            /* Mass Erase */
#define  FLASH_CR_OPTPG                      ((u16)0x0010)            /* Option Byte Programming */
#define  FLASH_CR_OPTER                      ((u16)0x0020)            /* Option Byte Erase */
#define  FLASH_CR_STRT                       ((u16)0x0040)            /* Start */
#define  FLASH_CR_LOCK                       ((u16)0x0080)            /* Lock */
#define  FLASH_CR_OPTWRE                     ((u16)0x0200)            /* Option Bytes Write Enable */
#define  FLASH_CR_ERRIE                      ((u16)0x0400)            /* Error Interrupt Enable */
#define  FLASH_CR_EOPIE                      ((u16)0x1000)            /* End of operation interrupt enable */


/*******************  Bit definition for FLASH_AR register  *******************/
#define  FLASH_AR_FAR                        ((u32)0xFFFFFFFF)        /* Flash Address */


/******************  Bit definition for FLASH_OBR register  *******************/
#define  FLASH_OBR_OPTERR                    ((u16)0x0001)            /* Option Byte Error */
#define  FLASH_OBR_RDPRT                     ((u16)0x0002)            /* Read protection */

#define  FLASH_OBR_USER                      ((u16)0x03FC)            /* User Option Bytes */
#define  FLASH_OBR_WDG_SW                    ((u16)0x0004)            /* WDG_SW */
#define  FLASH_OBR_nRST_STOP                 ((u16)0x0008)            /* nRST_STOP */
#define  FLASH_OBR_nRST_STDBY                ((u16)0x0010)            /* nRST_STDBY */
#define  FLASH_OBR_Notused                   ((u16)0x03E0)            /* Not used */


/******************  Bit definition for FLASH_WRPR register  ******************/
#define  FLASH_WRPR_WRP                        ((u32)0xFFFFFFFF)        /* Write Protect */


/*----------------------------------------------------------------------------*/


/******************  Bit definition for FLASH_RDP register  *******************/
#define  FLASH_RDP_RDP                       ((u32)0x000000FF)        /* Read protection option byte */
#define  FLASH_RDP_nRDP                      ((u32)0x0000FF00)        /* Read protection complemented option byte */


/******************  Bit definition for FLASH_USER register  ******************/
#define  FLASH_USER_USER                     ((u32)0x00FF0000)        /* User option byte */
#define  FLASH_USER_nUSER                    ((u32)0xFF000000)        /* User complemented option byte */


/******************  Bit definition for FLASH_Data0 register  *****************/
#define  FLASH_Data0_Data0                   ((u32)0x000000FF)        /* User data storage option byte */
#define  FLASH_Data0_nData0                  ((u32)0x0000FF00)        /* User data storage complemented option byte */


/******************  Bit definition for FLASH_Data1 register  *****************/
#define  FLASH_Data1_Data1                   ((u32)0x00FF0000)        /* User data storage option byte */
#define  FLASH_Data1_nData1                  ((u32)0xFF000000)        /* User data storage complemented option byte */


